---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricArea
source: html/b8e6a637-e069-500d-b7d3-3500e1728681.htm
---
# Autodesk.Revit.DB.Structure.FabricArea

An object that represents an Fabric Area Distribution within the Autodesk Revit project. It is container for Fabric Sheet elements.

## Syntax (C#)
```csharp
public class FabricArea : Element
```

## Remarks
This object derived from the Element base object and such supports all the
 methods of that object such as the ability to retrieve the parameters of that object.
 The Fabric Area element is available only in the Autodesk Revit Structure product.